# Задача 1: Посчитайте сумму трёх введённых чисел.
# 1 + 2 + 3 = 6

number1 = int(input('введите первое чесло: '))
number2 = int(input('введите второе чесло: '))
number3 = int(input('введите третье чесло: '))

summa = number1 + number2 + number3

print(f'{number1} + {number2} + {number3} = {summa}')